let a2_res,
    a8_res = [],
    a9_res = [],
    a10_res = {},
    a11_res = [],
    a12_res = [],
    a15_res = [],
    a16_res = {},
    a18_res = {},
    s20_res,
    s21_res;

// Task 1 ============================================
/* Создайте новый Set. Добавьте в него через add элементы. Выведите в консоль.  */

function t1() {
    let a1 = new Set();
    a1.add("Element 1");
    a1.add(1994);
    a1.add('hello');
    console.log(a1);
}

document.querySelector('.b-1').onclick = t1;

// Task 2 ============================================
/*  Создайте input куда пользователь может вводить элементы и кнопку. По нажатию на кнопку значение из input добавляется в set. Set выводится в консоль.Результат присвойте переменной a2_res. Действия запускаются при вызове функции t2. */
a2_res = new Set();

function t2(elem) {

    a2_res.add(elem);

    console.log(a2_res);
}

document.querySelector('.b-2').onclick = function () {
    let input = document.querySelector('.i-2').value;

    t2(input);

}


// Task 3 ============================================
/* Добавьте к предыдущему заданию кнопку удалить. При нажатии кнопки читаете содержимое input и удаляете его из Set. Если input пустой - выводите ошибку(alert). */

function t3(elem) {
    if (elem.trim() == '') {
        alert("Пустой input");
        return;
    } else {
        a2_res.delete(elem);
    }
}
document.querySelector('.b-3-show').onclick = function () {
    console.log(a2_res);
}

document.querySelector('.b-3').onclick = function () {
    t3(document.querySelector('.i-3').value);
}


// Task 4 ============================================
/*  Добавьте к предыдущему заданию кнопку проверить. При нажатии кнопки читаете содержимое input и проверяет его наличие в Set. Функция должна возвращать true или false.Действия запускаются при вызове функции t4. 
 */

function t4(elem) {
    return a2_res.has(elem);
}

document.querySelector('.b-4').onclick = function () {
    let res = t4(document.querySelector('.i-4').value);
    console.log(res);
}



// Task 5 ============================================
/*  Выведите размер полученного в результате предыдущих операций Set. Выводить на страницу и возвращать в функции.
 Действия должны запускаться при вызове функции t5. */

function t5() {
    let size = a2_res.size;
    console.log("Размер равен " + size);
    return size;
}

document.querySelector('.b-5').onclick = t5;


// Task 6 ============================================
/* Есть массив  a6 = [3,4,3,2,4,56,1,23]. Напишите функцию, которая возвращает и выводит на страницу количество уникальных элементов в массиве a6. Решение должно использовать set.
Действия должны запускаться при вызове функции t6. */

let a6 = [3, 4, 3, 2, 4, 56, 1, 23];

function t6(a6) {
    let arr6_set = new Set(a6);
    console.log("Количество уникальных элементов в массиве a6 - " + arr6_set.size)
    return arr6_set.size;
}

document.querySelector('.b-6').onclick = function () {
    t6(a6);
}


// Task 7 ============================================
/*  Создайте input куда пользователь может ввести пароль и кнопку - проверить. Проверяйте с помощью Set, чтобы пользователь использовал в пароле только не повторяющиеся символы. Логика решения - получаем строку из input - и преобразуем ее в массив (arr.split('')). Считаем длину массива. На основе массива создаем  Set. Сравниваем размеры массива и Set. Функция должна возвращать true или false. Запуск - по нажатию кнопки b-7. */

function t7(login, pass) {

    let login_check = new Set(login.split(''));
    let pass_check = new Set(pass.split(''));

    if (login.length == login_check.size && pass.length == pass_check.size) {
        return true;
    }
    return false;
}

document.querySelector('.b-7').onclick = function () {
    let login = document.querySelector('.login').value;
    let pass = document.querySelector('.pass').value;
    let res = t7(login, pass);
    console.log(res);
}

// Task 8 ============================================
/* Создайте набор set a8. Напишите функцию, которая принимает set в качестве параметра и четные элементы из набора добавляет в массив a8_res. После завершения операции - выводит a8_res на страницу. Запуск - по нажатию кнопки b-8. */

function t8(a8) {
    let result = document.querySelector(".out-8");
    for (let item of a8) {
        if (item % 2 == 0) {
            a8_res.push(item);
        }
    }
    result.innerHTML = "Вывод четных элементов из массива a8_res :   " + a8_res;
}

document.querySelector('.b-8').onclick = function () {
    let a8 = new Set();
    for (let i = 1; i < 17; i++) {
        a8.add(i);
    }

    t8(a8);
}


// Task 9 ============================================
/*  Создайте набор set a9. Напишите функцию, которая принимает set в качестве параметра присваивает a9_res так, что порядок элементов в a9_res обратный a9. Выведите a9_res на страницу. Действия должны запускаться при вызове функции t9.*/


function t9(a9) {
    let result = document.querySelector(".out-9");
    for (let item of a9) {
        a9_res.unshift(item);
    }
    result.innerHTML = "Вывод из Set в обратном порядке :   " + a9_res;
}

document.querySelector('.b-9').onclick = function () {
    let a9 = new Set();
    for (let i = 1; i < 10; i++) {
        a9.add(i);
    }
    t9(a9);
}


// Task 10 ============================================
/*  Сложная задача!!! Самая сложная задача за урок. Если ее решите - то массивов вы больше не испугаетесь. Задачу Можно пропустить. Создайте массив элементов a10. Посчитайте, сколько раз встречается каждый из элементов в массиве. Результат присвойте массиву a10_res.
Логика решения: создайте на основе массива - набор. Потом запустите перебор набора и внутри цикла перебора запустите еще один цикл - перебираете массив и смотрите совпадения если элемент массива совпадает с элементом набора - то плюсуете счетчик. После прохода внутреннего цикла добавляете в a20_res запись в виде элемент набора - счетчик.
 */



let a10 = [5, 7, 9, 11, 13, 15, 5, 7, 5, 2, 3, 7, 13];

function t10(a10) {

    let a10_set = new Set(a10);
    let count = 0;
    let result = document.querySelector(".out-10");
    let a10_res = {};

    // перебираем значения из Set
    for (let item of a10_set) {
        // перебираем массив a10
        for (let i = 0; i < a10.length; i++) {
            if (item == a10[i])
                count++;
        }
        a10_res[item] = count;
        count = 0;
    }

    for (let key in a10_res) {
        result.innerHTML += key + " встречается " + a10_res[key] + " раз(а)<br>";
    }
}

document.querySelector('.b-10').onclick = function () {
    t10(a10);
}


// Task 11 ============================================
/*  Эмулируем работу set. Пользователь может ввести значение в i-11. Напишите функцию, которая по нажатию b-11 запускает функцию t11. Функция получает введенное значение и добавляет его в массив a11_res. Добавление происхдит если такого значения в массиве нет. После каждой операции выводите a11_res на страницу.
 */


function t11(a11) {
    let out = document.querySelector(".out-11");

    for (let i = -1; i < a11_res.length; i++) {
        if (!a11_res.includes(a11)) {
            a11_res.unshift(a11);
        }
    }
    out.innerHTML = a11_res;
    console.log(a11_res);
}

document.querySelector('.b-11').onclick = function () {
    t11(document.querySelector('.i-11').value);
}


// Task 12 ============================================!
/*  Напишите функцию, которая принимает в качестве параметра набор set и преобразует его в массив, результат выводит на страницу и присваивает a12_res. Действия должны запускаться при вызове функции t12.
 */


let a12 = new Set();

function t12(a12) {
    let out = document.querySelector(".out-12");
    a12_res = Array.from(a12);
    out.innerHTML = a12_res;

}

document.querySelector('.b-12').onclick = () => {

    for (let i = 0; i < 11; i++) {
        a12.add(i);
    }

    t12(a12);
}

// Task 13 ============================================!
/*  
    Напишите функцию, которая принимает set и выводит его на страницу в указанный элемент. Элемент задавать как второй параметр.
    Действия должны запускаться при вызове функции t13.
 */

let elem13 = document.querySelector(".out-13");
let set13 = new Set();

function t13(set13, elem13) {
    elem13.innerHTML =set13;
    console.log(set13);
}

document.querySelector('.b-13').onclick = () => {

    set13.add("Hi");
    set13.add("I");
    set13.add("am");
    set13.add("test");
    set13.add("string");

    t13(set13, elem13);
}


// Task 14 ============================================
/*  
    Напишите функцию, которая принимает set и выводит его на страницу в указанный элемент. Элемент задавать как второй параметр. Третий параметр - разделитель. 
        Действия должны запускаться при вызове функции t14.
        Т.е. ввели в качестве разделителя дефис и вывод на страницу 1-2-3- (без пробелов).
 */

// let set14 = 
// let elem14 = 
// let sep14 = '-'

function t14(a14) {


}

document.querySelector('.b-14').onclick = () => {
    t14(set14, elem14, sep14);
}

// Task 15 ============================================!
/*  
Дан массив a15. Добавьте вложенные в него массивы  в набор. Изучите результат. Результирующий набор выведите на страницу. Добавление сделайте через цикл. 
    Действия должны запускаться при вызове функции t15. Результат операции запишите в a15_res.
 */

let a15 = [
    [1, 0],
    [1, 0],
    [2, 0]
];

function t15(a15) {


}

document.querySelector('.b-15').onclick = function () {
    t15(a15);
}


// Task 16 ============================================
/* 
Дан массив a16 = [
    { Ivan: 1 },
    { Ivan: 1 },
    { Ivan: 2 },
    { Serg: 0 }
]. Добавьте вложенные в него массивы  в набор. Изучите результат. Результирующий набор  выведите в консоль. Добавление сделайте через цикл. 
    Действия должны запускаться при вызове функции t15. 
    Результат операции запишите в a16_res.
 */

let a16 = [{
        Ivan: 1
    },
    {
        Ivan: 1
    },
    {
        Ivan: 2
    },
    {
        Serg: 0
    }
];

function t16(a16) {


}

document.querySelector('.b-16').onclick = function () {
    t16(a16);
}

// Task 17 ============================================
/*  Дана строка u17 = 'Primer'. Создайте новый набор с Set(u17). Выведите в консоль. Изучите результат.
    Действия должны запускаться при вызове функции t17.
 */


function t17() {
    let u17 = 'Primer';

}

document.querySelector('.b-17').onclick = t17;

// Task 18 ============================================
/*  
    Очень сложное! Можно пропустить без последствий! Напишите функцию, которая принимает строку и считает сколько раз встречается та либо инная буква. Результат в виде ассоциативного массива присваивает в переменуню a18_res. Данную функцию можно использовать для анализа текста.
    Действия должны запускаться при вызове функции t18.
 */

let a18 = 'Hello';

function t18(a18) {


}

document.querySelector('.b-18').onclick = function () {
    t18(a18)
};

// Task 19 ============================================!!!
/*  Создайте набор a19 и добавьте в него значения. Выведите на страницу каждый второй по счету элемент набора.
    Действия должны запускаться при вызове функции t19.
 */

// let a19 = 

function t19() {

}

document.querySelector('.b-19').onclick = () => {
    t19(a19)
};

// Task 20 ============================================!!!
/* Создайте функцию, которая принимает массив и четные по индексу элементы добавляет в набор s20_res в нечетные в набор s21_res. Выводите данные наборы в консоль.
 */

function t20(a20) {}

document.querySelector('.b-20').onclick = function () {
    // let arr20 = 
    t20(arr20);
}